src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/Catalogs/ШаблоныТекстов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</Catalog>
</MetaDataObject>

src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/Enums/ОбластиПримененияШаблоновТекстов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОбластиПримененияШаблоновТекстов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/Enums/ТипыТекстовПочтовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыТекстовПочтовыхСообщений</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/Catalogs/ШаблоныТекстов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздать_ШаблонАвтоответаПриРегистрацииВходящегоДокументаСНомеромИсходящего() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("24ee2a4d-2a6b-49b4-9071-d0d33ab07c2b");
	ШаблонТекстаСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ШаблонТекстаСсылка) Тогда 
		
		ШаблонТекстаОбъект = СоздатьЭлемент();
		ШаблонТекстаОбъект.УстановитьСсылкуНового(ШаблонТекстаСсылка);
		
		ШаблонТекстаОбъект.Наименование = НСтр(
			"ru = 'Шаблон автоответа при регистрации входящего документа с номером исходящего'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ШаблонТекстаОбъект.Шаблон = 
			НСтр("ru = 'Добрый день!
				|
				|Ваше письмо (исх. от %3 № %4) зарегистрировано %1 под № %2.
				|
				|Уведомление сформировано автоматически СЭД ФБУ ""Тест-С.-Петербург"".'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ШаблонТекстаОбъект.ОбщийШаблон = Истина;
		ШаблонТекстаОбъект.ОбластьПрименения = Перечисления.ОбластиПримененияШаблоновТекстов.Почта;
		ШаблонТекстаОбъект.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.ПростойТекст; 
		ШаблонТекстаОбъект.Автор = Пользователи.ТекущийПользователь();
		
		ШаблонТекстаОбъект.УстановитьНовыйКод();
		
		ШаблонТекстаОбъект.Записать();
		
	КонецЕсли;
	
	Возврат ШаблонТекстаСсылка;
	
КонецФункции

Функция НайтиСоздать_ШаблонАвтоответаПриРегистрацииВходящегоДокумента() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("88bc2a98-75ab-4ab9-8ddf-02a3b758a7a2");
	ШаблонТекстаСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ШаблонТекстаСсылка) Тогда 
		
		ШаблонТекстаОбъект = СоздатьЭлемент();
		ШаблонТекстаОбъект.УстановитьСсылкуНового(ШаблонТекстаСсылка);
		
		ШаблонТекстаОбъект.Наименование = НСтр(
			"ru = 'Шаблон автоответа при регистрации входящего документа без номера исходящего'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ШаблонТекстаОбъект.Шаблон = 
			НСтр("ru = 'Добрый день!
				|
				|Ваше письмо зарегистрировано %1 под № %2.
				|
				|Уведомление сформировано автоматически СЭД ФБУ ""Тест-С.-Петербург"".'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ШаблонТекстаОбъект.ОбщийШаблон = Истина;
		ШаблонТекстаОбъект.ОбластьПрименения = Перечисления.ОбластиПримененияШаблоновТекстов.Почта;
		ШаблонТекстаОбъект.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.ПростойТекст;
		ШаблонТекстаОбъект.Автор = Пользователи.ТекущийПользователь();
		
		ШаблонТекстаОбъект.УстановитьНовыйКод();
		
		ШаблонТекстаОбъект.Записать();
		
	КонецЕсли;
	
	Возврат ШаблонТекстаСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
